cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# CLI
# Moving git to dotfiles setup
brew 'neovim'
brew 'tree'
cask 'iterm2'

# Quality of Life
cask 'caffeine'
cask 'flux'
cask 'amethyst'

# Applications
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'postman'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'beyond-compare'

# Programming
brew 'k6'

# Go
brew 'go'

# Java
cask 'intellij-idea-ce'

# Javascript
brew 'yarn'

# Python
brew 'python3'

# Android SDK requirements
# cask 'intel-haxm'
# cask 'android-studio'

# Appium
# brew 'appium'
# brew 'appium-doctor'
# brew 'carthage'

# Hacking
cask 'burp-suite'
