cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'node'
brew 'git'
brew 'zsh'
brew 'python3'

# Appium
# brew 'appium'
# brew 'appium-doctor'
# brew 'carthage'

# cask '1password'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
# cask 'sketch'
cask 'iterm2'
cask 'spotify'
cask 'flux'
cask 'postman'
# cask 'filezilla'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'flux'
cask 'intellij-idea-ce'
cask 'pgadmin4'
# cask 'gimp'
cask caffeine
cask beyond-compare

# Android SDK requirements
# cask 'intel-haxm'
# cask 'android-studio'
