cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'node'
brew 'git'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'yarn'
brew 'zsh'
brew 'python3'
brew 'ant'
brew 'maven'
brew 'gradle'
brew 'exercism'

# cask '1password'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
# cask 'sketch'
# cask 'iterm2'
cask 'spotify'
cask 'flux'
cask 'postman'
# cask 'filezilla'
cask 'sublime-text'
# cask 'visual-studio-code'
cask 'flux'
cask 'intellij-idea-ce'
cask 'pgadmin4'
# cask 'gimp'

# Android SDK requirements
cask 'intel-haxm'
cask 'android-studio'
